tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "microsoft/git"
tap "mongodb/brew"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Fulltext search engine and column store
brew "groonga"
# OpenType text shaping engine
brew "harfbuzz"
# Enhanced version of john, a UNIX password cracker
brew "john-jumbo"
# Drop-in replacement for MySQL
brew "mariadb"
# Platform built on V8 to build network applications
brew "node@16"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Open source relational database management system
brew "mysql-client"
# Fast, highly customisable system info script
brew "neofetch"
# Development kit for the Java programming language
brew "openjdk"
# General-purpose scripting language
brew "php"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Software environment for statistical computing
brew "r"
# Internet file retriever
brew "wget"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# E-books management software
cask "calibre", args: { language: "s" }
# Free and open-source web browser
cask "chromium"
# Clipboard manager
cask "copyclip"
# Server and cloud storage browser
cask "cyberduck"
# App to build and share containerized applications and microservices
cask "docker"
cask "git-credential-manager-core"
# Web browser
cask "google-chrome"
# Web browser
cask "librewolf"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Data science software focusing on R and Python
cask "rstudio"
# Instant messaging application focusing on security
cask "signal"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Multimedia player
cask "vlc"
vscode "bmewburn.vscode-intelephense-client"
vscode "codezombiech.gitignore"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "KevinRose.vsc-python-indent"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.vscode-typescript-next"
vscode "RDebugger.r-debugger"
vscode "redhat.vscode-xml"
vscode "REditorSupport.r"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "wholroyd.jinja"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "ZainChen.json"
vscode "zobo.php-intellisense"
